#include <stdio.h>
#include <stdlib.h>
#include "insertionsort.h"

void insertionsort2(item *a, int n) {
	int i, j;
	/* ταξινόμηση όλων των αντικειμένων */
	for (i = 1; i < n; i++) {
		/* σύγκριση του αντικειμένου i με όλα τα αντικείμενα στα αριστερά του */
		for (j = i; j > 0; j--) {
			compexch(a[j], a[j - 1]); /* σύγκριση και αντιμετάθεση αντικειμένων */
		}
	}
}

/* Λειτουργία: Αλγόριθμος ταξινόμησης με εισαγωγή (αποδοτική υλοποίηση)
Είσοδος: Ο πίνακας προς ταξινόμηση και το μέγεθος του πίνακα
Έξοδος: Ένας ταξινομημένος πίνακας */
void insertionsort(item *a, int n) {
	int i, j;
	item temp;
	/* μετακίνηση του μικρότερου στοιχείου στην αρχή του πίνακα για να παίξει το ρόλο φρουρού */
	for (i = 1; i < n; i++) {
		compexch(a[i], a[0]);
	}
	/* ταξινόμηση όλων των αντικειμένων */
	for (i = 2; i < n; i++) {
		j = i;
		temp = a[i];
		/* σύγκριση του αντικειμένου i με όλα τα αντικείμενα στα αριστερά του μέχρι να βρει το πρώτο μεγαλύτερο αντικείμενο */
		while (less(temp, a[j - 1])) {
			a[j] = a[j - 1];
			j--;
		}
		a[j] = temp;
	}
}

/* Λειτουργία: Εκτύπωση στοιχείων πίνακα
Είσοδος: Ο πίνακας και το μέγεθος του πίνακα
Έξοδος: - */
void displayInsertion(item *a, int n) {
	int i;
	printf("-----\n");
	for (i = 0; i < n; i++) {
		printf("%d ", a[i]);
	}
	printf("\n-----\n");
}
