#include <stdio.h>
#include <stdlib.h>
#include "nonrec_mergesort.h"

/* Λειτουργία: Αλγόριθμος ταξινόμησης με συγχώνευση (μη αναδρομική υλοποίηση)
Είσοδος: Ο πίνακας προς ταξινόμηση και οι δείκτες l και r που δείχνουν το κομμάτι του πίνακα προς ταξινόμηση
Έξοδος: Ένας ταξινομημένος πίνακας */
void mergesort(item a[], int l, int r) {
	int i, m;
	for (m = 1; m <= r - l; m = m + m)
		for (i = l; i <= r - m; i += m + m)
			merge(a, i, i + m - 1, min(i + m + m - 1, r));
}

/* Λειτουργία: Βοηθητική συνάρτηση συγχώνευσης
Είσοδος: Ο πίνακας προς ταξινόμηση, οι δείκτες l και r που δείχνουν το κομμάτι του πίνακα προς συγχώνευση, και ο δείκτης m που δείχνει που σταματάει ο πρώτος υποπίνακας
Έξοδος: Ένας ταξινομημένος πίνακας που συγχωνεύσει τους δύο υποπίνακες
*/
void merge(item a[], int l, int m, int r) {
	int i, j, k;
	/* αντιγραφή στον βοηθητικό πίνακα του πρώτου υποπίνακα */
	for (i = m + 1; i > l; i--)
		aux[i - 1] = a[i - 1];
	/* αντιγραφή στον βοηθητικό πίνακα του αντιστραμμένου δεύτερου υποπίνακα */
	for (j = m; j < r; j++)
		aux[r + m - j] = a[j + 1];
	/* συγχώνευση */
	for (k = l; k <= r; k++)
		if (less(aux[j], aux[i]))
			a[k] = aux[j--];
		else a[k] = aux[i++];
}

/* Λειτουργία: Εκτύπωση στοιχείων πίνακα
Είσοδος: Ο πίνακας και το μέγεθος του πίνακα
Έξοδος: - */
void display(item *a, int n) {
	int i;
	printf("-----\n");
	for (i = 0; i < n; i++) {
		printf("%d ", a[i]);
	}
	printf("\n-----\n");
}
