/* Αρχείο: set.c
Περιγραφή: Υλοποίηση για την δομή δεδομένων σύνολο
Συγγραφέας: Νικόλαος Πλόσκας */

#include <stdio.h>
#include <stdlib.h>
#include "set.h"

/* Λειτουργία: Δημιουργεί το κενό σύνολο
Είσοδος: Ένας πίνακας που αναπαριστά το σύνολο
Έξοδος: Το κενό σύνολο */
void initialize(bool set[]) {
	int i;
	for (i = 0; i < n; i++) {
		set[i] = false;
	}
}

/* Λειτουργία: Εμφανίζει τα στοιχεία του συνόλου
Είσοδος: Ένας πίνακας που αναπαριστά το σύνολο
Έξοδος: Τα στοιχεία του συνόλου */
void display(bool set[]) {
	int i;
	printf("**********\n");
	for (i = 0; i < n; i++) {
		if (set[i])
			printf("%3d", i);
	}
	printf("\n**********\n\n");
}

/* Λειτουργία: Εισάγει ένα στοιχείο στο σύνολο
Είσοδος: Το σύνολο και το στοιχείο προς εισαγωγή
Έξοδος: Το τροποποιημένο σύνολο */
void insert(bool set[], int index) {
	set[index] = true;
}

/* Λειτουργία: Διαγράφει ένα στοιχείο από το σύνολο
Είσοδος: Το σύνολο και το στοιχείο προς εξαγωγή
Έξοδος: Το τροποποιημένο σύνολο */
void delete(bool set[], int index) {
	set[index] = false;
}

/* Λειτουργία: Ελέγχει αν ένα στοιχείο είναι μέλος του συνόλου
Είσοδος: Το σύνολο και το στοιχείο προς αναζήτηση
Έξοδος: Επιστρέφει TRUE αν το στοιχείο είναι μέλος του συνόλου και FALSE διαφορετικά */
bool is_member(bool set[], int index) {
	return set[index];
}

/* Λειτουργία: Ελέγχει αν το σύνολο είναι κενό
Είσοδος: Το σύνολο
Έξοδος: Επιστρέφει TRUE αν το σύνολο είναι κενό και FALSE διαφορετικά */
bool is_empty(bool set[]) {
	int i = 0;
	bool empty = true;
	while (i < n && empty) {
		if (is_member(set, i))
			empty = false;
		else
			i++;
	}
	return empty;
}

/* Λειτουργία: Ελέγχει αν δύο σύνολα είναι ίσα
Είσοδος: Δύο σύνολα
Έξοδος: Επιστρέφει TRUE αν τα δύο σύνολα είναι ίσα και FALSE διαφορετικά */
bool are_equal(bool set1[], bool set2[]) {
	int i = 0;
	bool equal = true;
	while (i < n && equal) {
		if (is_member(set1, i) != is_member(set2, i))
			equal = false;
		else
			i++;
	}
	return equal;
}

/* Λειτουργία: Ελέγχει αν το πρώτο σύνολο είναι υποσύνολο του δεύτερου
Είσοδος: Δύο σύνολα
Έξοδος: Επιστρέφει TRUE αν το πρώτο σύνολο είναι ένα υποσύνολο του δεύτερου */
bool is_subset(bool set1[], bool set2[]) {
	int i = 0;
	bool subset = true;
	while (i < n && subset) {
		if (is_member(set1, i) && !is_member(set2, i))
			subset = false;
		else
			i++;
	}
	return subset;
}

/* Λειτουργία: Δημιουργεί ένα νέο σύνολο με τα στοιχεία που ανήκουν στην ένωση των δύο συνόλων
Είσοδος: Τα δύο σύνολα προς ένωση και το σύνολο που θα περιέχει το αποτέλεσμα της ένωσης
Έξοδος: Επιστρέφει το σύνολο που προκύπτει από την ένωση των δύο συνόλων */
void union_sets(bool set1[], bool set2[], bool result[]) {
	int i;
	for (i = 0; i < n; i++)
		result[i] = is_member(set1, i) || is_member(set2, i);
}

/* Λειτουργία: Δημιουργεί ένα νέο σύνολο με τα στοιχεία που ανήκουν στην τομή των δύο συνόλων
Είσοδος: Τα δύο σύνολα προς τομή και το σύνολο που θα περιέχει το αποτέλεσμα της τομής
Έξοδος: Επιστρέφει το σύνολο που προκύπτει από την τομή των δύο */
void intersection_sets(bool set1[], bool set2[], bool result[]) {
	int i;
	for (i = 0; i < n; i++)
		result[i] = is_member(set1, i) && is_member(set2, i);
}

/* Λειτουργία: Δημιουργεί ένα νέο σύνολο με τα στοιχεία που ανήκουν στο πρώτο σύνολο και δεν ανήκουν στο δεύτερο
Είσοδος: Τα δύο σύνολα από τα οποία θέλουμε να βρούμε την διαφορά και το σύνολο που θα περιέχει το αποτέλεσμα της διαφοράς
Επιστρέφει: Επιστρέφει το σύνολο που προκύπτει από την διαφορά του πρώτου από το δεύτερο σύνολο */
void subtraction_sets(bool set1[], bool set2[], bool result[]) {
	int i;
	for (i = 0; i < n; i++)
		result[i] = is_member(set1, i) && !is_member(set2, i);
}